modules/admin/controllers/AdminController.php

    public function actionDelete($id)
    {
        $model = User::findOne($id);
        $model->delete();
---
SELECT * FROM `users` WHERE `id`='19'
DELETE FROM `users` WHERE `id`=19

    public function actionIndex()
    {
        if (Yii::$app->user->isGuest) {
            return $this->goHome();
        }
        $usersList = User::find()->all();
---
SELECT * FROM `users`

    public function actionUpdate($id)
    {
        if (Yii::$app->user->isGuest) {
            return $this->goHome();
        }

        $model = User::findOne($id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
SELECT * FROM `users` WHERE `id`='15'
UPDATE `users` SET `accessToken`='31681' WHERE `id`=15