controllers/AdminController.php

    public function actionDelete($id)
    {
        $model = User::findOne($id);
        $model->delete();
---
SELECT * FROM `users` WHERE `id`='6'
DELETE FROM `users` WHERE `id`=6

    public function actionIndex()
    {
        if (Yii::$app->user->isGuest) {
            return $this->goHome();
        }
        $usersList = User::find()->all();
---
SELECT * FROM `users`