modules/api/controllers/MetricController.php

SELECT * FROM `metrics`
---
    public function actions()
    {
        $actions = [
            'index' => [
                'class' => IndexAction::class,
                'modelClass' => $this->modelClass,
                'prepareDataProvider' => function () {
                    $model = new Metric();
                    return $model::find()->where(Yii::$app->request->queryParams)->all();
                },
            ],
        ];