models/SignupForm.php

    public function save(){
        if ($this->validate()){
           $user = new User();
           $user->id = $user->getId();
           $user->login = $this->login;
           $user->password = md5($this->password);
           return $user->save();
---
INSERT INTO `users` (`id`, `login`, `password`) VALUES (NULL, 'mytest1', 'e10adc3949ba59abbe56e057f20f883e')