models/User.php

SELECT * FROM `users` WHERE `users`.`login`='admin'
---
    public static function findByUsername($username)
    {
        return self::findOne(['users.login' => $username]);

SELECT * FROM `users` WHERE `users`.`id`=11
---
    public static function findIdentity($id)
    {
        return self::findOne(['users.id' => $id]);